## Fishing vessels data cleaning

In [1]:
#importing libraries

import pandas as pd
import numpy as np

In [2]:
#importing fishing vessels file

fv=pd.read_csv("../data/fishing_vessels.csv")

In [3]:
#check file

fv.head()

,mmsi,flag,geartype,length,tonnage,engine_power,active_2012,active_2013,active_2014,active_2015,active_2016
0,603100157,AGO,trawlers,32.808468,299.003814,733.826977,False,False,False,True,True
1,603100137,AGO,trawlers,34.568782,395.683171,864.960188,False,False,False,True,True
2,603100161,AGO,trawlers,28.822140,263.849149,651.809642,False,False,False,True,True
3,603100174,AGO,trawlers,30.721429,299.700916,703.796086,False,False,False,True,True
4,603100164,AGO,trawlers,37.479248,405.967747,850.976640,False,False,False,True,True

In [4]:
# number of rows

fv.index

RangeIndex(start=0, stop=73009, step=1)

In [5]:
#number of columns

fv.columns

Index(['mmsi', 'flag', 'geartype', 'length', 'tonnage', 'engine_power',
       'active_2012', 'active_2013', 'active_2014', 'active_2015',
       'active_2016'],
      dtype='object')

In [6]:
#check activity thinking of the merge

fv['active_2016'].value_counts()

True     60410
False    12599
Name: active_2016, dtype: int64

In [7]:
#check activity thinking of the merge

fv['active_2015'].value_counts()

True     55508
False    17501
Name: active_2015, dtype: int64

In [8]:
#keeping the boats active in 2015 or 2016 thinking of the merging

fv=fv.loc[(fv['active_2016']==True) | (fv['active_2015']==True)]

In [9]:
#check dataframe

fv.head()

,mmsi,flag,geartype,length,tonnage,engine_power,active_2012,active_2013,active_2014,active_2015,active_2016
0,603100157,AGO,trawlers,32.808468,299.003814,733.826977,False,False,False,True,True
1,603100137,AGO,trawlers,34.568782,395.683171,864.960188,False,False,False,True,True
2,603100161,AGO,trawlers,28.822140,263.849149,651.809642,False,False,False,True,True
3,603100174,AGO,trawlers,30.721429,299.700916,703.796086,False,False,False,True,True
4,603100164,AGO,trawlers,37.479248,405.967747,850.976640,False,False,False,True,True

In [10]:
#check the drop

fv.index

Int64Index([    0,     1,     2,     3,     4,     5,     6,     7,     8,
                9,
            ...
            72999, 73000, 73001, 73002, 73003, 73004, 73005, 73006, 73007,
            73008],
           dtype='int64', length=66444)

In [11]:
#using the ISO table to actually have the country names

iso=pd.read_csv("../data/Country_ISO.csv")

In [12]:
#confirm iso is imported

iso.head()

  Code           Name
0  ABW          Aruba
1  AFG    Afghanistan
2  AGO         Angola
3  AIA       Anguilla
4  ALA  Åland Islands

In [13]:
#merging with main dataframe

merge_country=fv.merge(iso, left_on='flag', right_on='Code')

In [14]:
#confirm merging

merge_country.head()

,mmsi,flag,geartype,length,tonnage,engine_power,active_2012,active_2013,active_2014,active_2015,active_2016,Code,Name
0,603100157,AGO,trawlers,32.808468,299.003814,733.826977,False,False,False,True,True,AGO,Angola
1,603100137,AGO,trawlers,34.568782,395.683171,864.960188,False,False,False,True,True,AGO,Angola
2,603100161,AGO,trawlers,28.822140,263.849149,651.809642,False,False,False,True,True,AGO,Angola
3,603100174,AGO,trawlers,30.721429,299.700916,703.796086,False,False,False,True,True,AGO,Angola
4,603100164,AGO,trawlers,37.479248,405.967747,850.976640,False,False,False,True,True,AGO,Angola

In [15]:
#check if data not lost

merge_country.index

Int64Index([    0,     1,     2,     3,     4,     5,     6,     7,     8,
                9,
            ...
            66316, 66317, 66318, 66319, 66320, 66321, 66322, 66323, 66324,
            66325],
           dtype='int64', length=66326)

In [16]:
#dropping non-relevant columns

merge_country = merge_country.drop(['Code','active_2012','active_2013','active_2014','active_2015','active_2016'], axis=1)

In [17]:
#check the drop

merge_country

,mmsi,flag,geartype,length,tonnage,engine_power,Name
0,603100157,AGO,trawlers,32.808468,299.003814,733.826977,Angola
1,603100137,AGO,trawlers,34.568782,395.683171,864.960188,Angola
2,603100161,AGO,trawlers,28.822140,263.849149,651.809642,Angola
3,603100174,AGO,trawlers,30.721429,299.700916,703.796086,Angola
4,603100164,AGO,trawlers,37.479248,405.967747,850.976640,Angola
...,...,...,...,...,...,...,...
66321,601764000,ZAF,drifting_longlines,17.032258,52.550920,207.818629,South Africa
66322,601089100,ZAF,drifting_longlines,22.915622,180.506028,527.507463,South Africa
66323,601849000,ZAF,drifting_longlines,19.692080,86.485661,362.553279,South Africa
66324,601183700,ZAF,drifting_longlines,31.872860,307.446773,977.330342,South Africa
66325,601826000,ZAF,drifting_longlines,25.401070,160.784917,365.421212,South Africa

In [18]:
#check for nulls. mmsi null is pointless

merge_country['mmsi'].isnull().value_counts()

False    66326
Name: mmsi, dtype: int64

In [19]:
#rename columns

merge_country.columns=['mmsi','flag','gear_type','length','tonnage','engine_power','country']

In [20]:
#confirm

merge_country.head()

        mmsi flag gear_type     length     tonnage  engine_power country
0  603100157  AGO  trawlers  32.808468  299.003814    733.826977  Angola
1  603100137  AGO  trawlers  34.568782  395.683171    864.960188  Angola
2  603100161  AGO  trawlers  28.822140  263.849149    651.809642  Angola
3  603100174  AGO  trawlers  30.721429  299.700916    703.796086  Angola
4  603100164  AGO  trawlers  37.479248  405.967747    850.976640  Angola

In [21]:
#check the types

merge_country.dtypes

mmsi              int64
flag             object
gear_type        object
length          float64
tonnage         float64
engine_power    float64
country          object
dtype: object

## Merging the IUU information

In [22]:
#importing IUU ranking

IUU=pd.read_excel("../data/IUU.xlsx")

In [23]:
#check IUU is correctly imported

IUU.head()

                     Country  IUU Fishing
0                      China         3.93
1  Taiwan, Province of China         3.34
2                   Cambodia         3.23
3         Russian Federation         3.16
4                    Vietnam         3.16

In [24]:
#check the number of countries to be sure we dont lose anything

merge_country['country'].value_counts

<bound method IndexOpsMixin.value_counts of 0              Angola
1              Angola
2              Angola
3              Angola
4              Angola
             ...
66321    South Africa
66322    South Africa
66323    South Africa
66324    South Africa
66325    South Africa
Name: country, Length: 66326, dtype: object>

In [25]:
#final merge for this df

fish_vessel_IUU_df=merge_country.merge(IUU, how='left',left_on='country', right_on='Country')

In [26]:
#confirm the merge

fish_vessel_IUU_df.head()

,mmsi,flag,gear_type,length,tonnage,engine_power,country,Country,IUU Fishing
0,603100157,AGO,trawlers,32.808468,299.003814,733.826977,Angola,Angola,2.37
1,603100137,AGO,trawlers,34.568782,395.683171,864.960188,Angola,Angola,2.37
2,603100161,AGO,trawlers,28.822140,263.849149,651.809642,Angola,Angola,2.37
3,603100174,AGO,trawlers,30.721429,299.700916,703.796086,Angola,Angola,2.37
4,603100164,AGO,trawlers,37.479248,405.967747,850.976640,Angola,Angola,2.37

In [27]:
fish_vessel_IUU_df['country'].value_counts

<bound method IndexOpsMixin.value_counts of 0              Angola
1              Angola
2              Angola
3              Angola
4              Angola
             ...
66321    South Africa
66322    South Africa
66323    South Africa
66324    South Africa
66325    South Africa
Name: country, Length: 66326, dtype: object>

In [28]:
fish_vessel_IUU_df['Country'].value_counts

<bound method IndexOpsMixin.value_counts of 0              Angola
1              Angola
2              Angola
3              Angola
4              Angola
             ...
66321    South Africa
66322    South Africa
66323    South Africa
66324    South Africa
66325    South Africa
Name: Country, Length: 66326, dtype: object>

In [29]:
fish_vessel_IUU_df['IUU Fishing'].value_counts

<bound method IndexOpsMixin.value_counts of 0        2.37
1        2.37
2        2.37
3        2.37
4        2.37
         ...
66321    2.43
66322    2.43
66323    2.43
66324    2.43
66325    2.43
Name: IUU Fishing, Length: 66326, dtype: float64>

In [30]:
#check for missing values

fish_vessel_IUU_df.isna().sum()

mmsi              0
flag              0
gear_type         3
length            2
tonnage           2
engine_power      5
country           0
Country         296
IUU Fishing     296
dtype: int64

In [31]:
lost_data=fish_vessel_IUU_df.loc[fish_vessel_IUU_df["Country"].isna()]

In [32]:
lost_data['country'].value_counts

<bound method IndexOpsMixin.value_counts of 308           French Southern Territories
309           French Southern Territories
562      Bonaire, Sint Eustatius and Saba
563      Bonaire, Sint Eustatius and Saba
1344                          Switzerland
                       ...
61233           Saint Pierre and Miquelon
61234           Saint Pierre and Miquelon
61525            Turks and Caicos Islands
61526                                Chad
66047                            Viet Nam
Name: country, Length: 296, dtype: object>

In [33]:
#check problematic names

check_problems1 = lost_data.groupby(['country']).agg({'country':'count'})

In [34]:
check_problems1

                                              country
country
Bonaire, Sint Eustatius and Saba                    2
Cayman Islands                                      2
Chad                                                1
Curaçao                                             5
Falkland Islands (Malvinas)                        16
Faroe Islands                                     108
French Guiana                                      18
French Polynesia                                    1
French Southern Territories                         2
Greenland                                          52
Guadeloupe                                          1
Hong Kong                                          27
Macao                                               4
Martinique                                          1
Mongolia                                            9
New Caledonia                                      19
Réunion                                            20
Saint Helena, Ascension and Tristan da Cunha        2
Saint Pierre and Miquelon                           3
Switzerland                                         1
Turks and Caicos Islands                            1
Viet Nam                                            1

In [35]:
#checking the IUU scores to know if some are included in another country

#it seems Macao and Hong Kong are included in China according to IUU
# it seems greenland and faroe islands are included in Denmark according to IUU

In [36]:
#try to change the names from merge_country['country'] to Denmark and China in order not to loose considerable amount of data.
#the remanining countries are not very significative, can be dropped

In [37]:
#check problematic names

IUU['Country'].head(151)

0                          China
1      Taiwan, Province of China
2                       Cambodia
3             Russian Federation
4                        Vietnam
                 ...
146                       Sweden
147                       Poland
148                      Estonia
149                      Finland
150                       Latvia
Name: Country, Length: 151, dtype: object

## Changing the original file

In [38]:
#changing the original 

final_fv_df=merge_country.copy()

In [39]:
final_fv_df.head()

        mmsi flag gear_type     length     tonnage  engine_power country
0  603100157  AGO  trawlers  32.808468  299.003814    733.826977  Angola
1  603100137  AGO  trawlers  34.568782  395.683171    864.960188  Angola
2  603100161  AGO  trawlers  28.822140  263.849149    651.809642  Angola
3  603100174  AGO  trawlers  30.721429  299.700916    703.796086  Angola
4  603100164  AGO  trawlers  37.479248  405.967747    850.976640  Angola

In [40]:
#final_fv_df.groupby(['country']).agg({'country':'count'})

In [41]:
#change according to the IUU table, relevant ti change Macao, Hong Kong, Greenland and Faroe Islands

final_fv_df['country'] = np.where(final_fv_df['country'] == 'Macao', "China", final_fv_df['country'])
final_fv_df['country'] = np.where(final_fv_df['country'] == 'Hong Kong', "China", final_fv_df['country'])
final_fv_df['country'] = np.where(final_fv_df['country'] == 'Faroe Islands', "Denmark", final_fv_df['country'])
final_fv_df['country'] = np.where(final_fv_df['country'] == 'Greenland', "Denmark", final_fv_df['country'])
final_fv_df['country'] = np.where(final_fv_df['country'] == 'Viet Nam', "Vietnam", final_fv_df['country'])
final_fv_df['country'] = np.where(final_fv_df['country'] == 'Venezuela, Bolivarian Republic of', "Venezuela", final_fv_df['country'])

In [42]:
#create new df with merge improvement

fishing_trial_df=final_fv_df.merge(IUU, how='left',left_on='country', right_on='Country')

In [43]:
#check again the lost data

lost_data2=fishing_trial_df.loc[fishing_trial_df["Country"].isna()]

In [44]:
lost_data2.groupby(['country']).agg({'country':'count'})

                                              country
country
Bonaire, Sint Eustatius and Saba                    2
Cayman Islands                                      2
Chad                                                1
Curaçao                                             5
Falkland Islands (Malvinas)                        16
French Guiana                                      18
French Polynesia                                    1
French Southern Territories                         2
Guadeloupe                                          1
Martinique                                          1
Mongolia                                            9
New Caledonia                                      19
Réunion                                            20
Saint Helena, Ascension and Tristan da Cunha        2
Saint Pierre and Miquelon                           3
Switzerland                                         1
Turks and Caicos Islands                            1
Venezuela                                          16

## Final dataframe merge

In [45]:
#after checking the data lost is not relevant, the inner join makes more sense

fishing_final_df=final_fv_df.merge(IUU, how='inner',left_on='country', right_on='Country')

In [46]:
#confirm no relevant data was lost

fishing_final_df.index

Int64Index([    0,     1,     2,     3,     4,     5,     6,     7,     8,
                9,
            ...
            66196, 66197, 66198, 66199, 66200, 66201, 66202, 66203, 66204,
            66205],
           dtype='int64', length=66206)

In [47]:
#drop duplicated information

fishing_final_df=fishing_final_df.drop(['Country'], axis=1)

In [48]:
#check the information

fishing_final_df.head()

,mmsi,flag,gear_type,length,tonnage,engine_power,country,IUU Fishing
0,603100157,AGO,trawlers,32.808468,299.003814,733.826977,Angola,2.37
1,603100137,AGO,trawlers,34.568782,395.683171,864.960188,Angola,2.37
2,603100161,AGO,trawlers,28.822140,263.849149,651.809642,Angola,2.37
3,603100174,AGO,trawlers,30.721429,299.700916,703.796086,Angola,2.37
4,603100164,AGO,trawlers,37.479248,405.967747,850.976640,Angola,2.37

In [49]:
#import as CSV

fishing_final_df.to_csv('fishvessel_clean.csv', index=False)